# KWh Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KWh Property
SymbolTypeId Class See Also
---
Symbol kWh, indicating unit Kilowatt hours.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KWh { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KWh As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KWh {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace